{
  "Act 1": [
    "Kill Hillock at the end of the Twilight Strand.",
    "Enter Lioneye’s Watch and talk to Tarkleigh to receive the reward.",
    "Go to the Coast, grab the Waypoint, and proceed to the Mud Flats.",
    "In the Mud Flats, find the 3 Rhoa Nests and collect the Ammonite, Haliotis, and Roseus Glyphs.",
    "Use the glyphs to open the path to The Submerged Passage. Enter and take the Waypoint.",
    "Use the Waypoint to return to the Coast. Enter the Tidal Island on the right.",
    "Kill Hailrake and logout. Turn in the quest to Nessa. Take the Quicksilver Flask as your reward.",
    "Talk to Tarkleigh for your gem reward.",
    "Return to the Submerged Passage. If you find the Flooded Depths entrance, drop a portal nearby.",
    "Find the exit to the Ledge. Grab the Waypoint there and continue to the Climb.",
    "Run through the Climb, grabbing the Waypoint if seen, and enter the Lower Prison.",
    "Take the Lower Prison Waypoint back to Lioneye’s Watch.",
    "If your portal to Flooded Depths is open, take it. Otherwise, Waypoint to the Coast and enter Flooded Depths.",
    "Kill the Deep Dweller and logout. Turn in the quest to Tarkleigh for a Book of Skill.",
    "Return to the Lower Prison and complete the Labyrinth Trial.",
    "Find the Upper Prison, then the Warden’s Quarters, and finally Brutus.",
    "Kill Brutus and logout or portal out.",
    "Talk to Tarkleigh for a gem reward. Use the Waypoint to reach Prisoner’s Gate.",
    "Enter the Ship Graveyard and grab the Waypoint near the entrance.",
    "Continue to the Cavern of Wrath and take the Waypoint there. If you find the Ship Graveyard Cave entrance, drop a portal.",
    "Return to town and then back to the Ship Graveyard Cave using your portal or Waypoint.",
    "Retrieve the Allflame and return to the Ship Graveyard.",
    "Talk to Fairgraves and kill him.",
    "Logout or Waypoint to Lioneye’s Watch. Talk to Bestel for a Book of Skill, and Nessa for a gem reward.",
    "Take the Waypoint to the Cavern of Wrath. Proceed to the Cavern of Anger, then Merveil’s Lair.",
    "Kill Merveil and continue to the Southern Forest.",
    "Run to the Forest Encampment to finish Act I."
  ],
  "Act 2": [
    "Take the exit to the right to The Old Fields.",
    "If you have not found a second Quicksilver Flask, enter The Den, kill The Great White Beast, and exit back to The Old Fields.",
    "Otherwise, skip The Den and proceed to The Crossroads.",
    "Find the Waypoint in The Crossroads by following the road.",
    "Take the left path and proceed to The Chamber of Sins Level 1.",
    "Descend to The Chamber of Sins Level 2, grabbing the Waypoint if you come across it.",
    "Find and complete the Labyrinth Trial.",
    "Proceed to the end, kill Fidelitas, loot Fidelitas’ Spike, click the Strange Device, and loot the Baleful Gem. Then logout.",
    "Pick up your gem reward from Gruest and teleport back to The Crossroads.",
    "Go to The Fellshrine Ruins and enter The Crypt Level 1.",
    "Find and complete the Labyrinth Trial in The Crypt.",
    "Proceed to The Crypt Level 2.",
    "Locate Archbishop Geofri the Abashed (optional kill), then click the altar behind him, loot the Golden Hand, and logout.",
    "Pick up your Book of Skill reward from Yeena and return to The Crossroads.",
    "Head straight and enter the Broken Bridge.",
    "Proceed through the zone and deal with Kraityn (kill or help), then logout.",
    "Take the exit to the left to Riverways and follow the road.",
    "Pick up the Waypoint in Riverways and continue to the exit to the Western Forest.",
    "Proceed down the path in the Western Forest until you find the Waypoint.",
    "Opposite the Waypoint, run into the forest and follow the web-covered wall of trees to find and enter The Weaver’s Chambers.",
    "Proceed through The Weaver’s Chambers, kill The Weaver, pick up Maligaro's Spike, and logout.",
    "Pick up your gem reward from Silk and teleport back to Riverways.",
    "Proceed through the two pillars and keep going to find and enter The Wetlands.",
    "Find and kill or help Oak. Locate the Waypoint and take it back to the Western Forest.",
    "Near the Western Forest Waypoint, locate and deal with Alira (kill or help).",
    "Follow the left-side wall to find the Blackguard camp. Kill the leader, pick up the Thaumetic Emblem, use it on the Thaumetic Seal, then logout.",
    "Waypoint to Act 1 town and collect your Skill Book reward from Tarkleigh.",
    "Return to Act 2, talk to the NPCs to collect all remaining quest rewards.",
    "Teleport to The Wetlands.",
    "Poison the tree roots and enter the Vaal Ruins. Break the seal and exit into the Northern Forest.",
    "Head upward through the Northern Forest until you find The Caverns. Skip the Dread Thicket.",
    "Grab the Waypoint in The Caverns.",
    "Locate and enter the Ancient Pyramid.",
    "Ascend the levels of the Pyramid until you reach the Pyramid Apex.",
    "Slay the Vaal Oversoul and exit into the City of Sarn.",
    "Locate the Blackguards harassing Clarissa, kill them, and wait until she stands up. Speak with her.",
    "Follow the small staircase below Clarissa, then follow the water’s edge until you find the Sarn Encampment."
  ],
  "Act 3": [
    "Exit into the Slums.",
    "Find the Crematorium and grab the Waypoint. Take note of the location of the Sewer Grating if you encountered it along the way.",
    "Find the Labyrinth Trial in the Crematorium and complete it.",
    "Find Piety and defeat her. Interact with Tolman and take Tolman’s Bracelet.",
    "Logout or portal to town. Speak with Clarissa to receive the Sewer Keys.",
    "Enter the Slums and find the Sewer Grating. Open it, and enter the Sewers.",
    "Locate the three Platinum Busts: one before the Waypoint and two after.",
    "Find the exit into the Marketplace.",
    "Grab the Waypoint in the Marketplace.",
    "To the right of the Waypoint is the entrance to the Catacombs. Enter and complete the Labyrinth Trial, then logout and return to the Marketplace via the Waypoint.",
    "Locate the exit to the Battlefront.",
    "Find the Waypoint, generally in the center of the zone.",
    "Head downwards from the Waypoint until you find the Blackguard Chest, which looks like a cart. Take the Ribbon Spool from it.",
    "Head left from the Waypoint until you find the entrance to The Docks.",
    "Optional: If behind on levels, kill monsters in the Docks to catch up.",
    "Locate the Supply Container and loot the Thaumetic Sulphite, then logout.",
    "Take the Waypoint back to Battlefront and head upwards to the entrance of Solaris Temple (Level One).",
    "Proceed through the temple until you find the entrance to Solaris Temple (Level Two).",
    "Continue through the temple until you find the Waypoint.",
    "Talk to Lady Dialla to receive an Amulet reward and the Infernal Talc.",
    "Logout or portal to town, then talk to Hargan to receive the Book of Skill.",
    "Take the Waypoint to the Sewers.",
    "Go down/left from the Waypoint and burn away the Undying Blockage, close to the Waypoint.",
    "Enter the Ebony Barracks and acquire the Waypoint.",
    "Head upwards through the Ebony Barracks until you find General Gravicius.",
    "Kill General Gravicius and continue heading upwards.",
    "Enter the Lunaris Temple (Level One).",
    "Grab the Waypoint and enter the Lunaris Temple (Level Two).",
    "Look for ascending staircases to find the correct path quickly. Continue following staircases until you reach the carts. The side with two carts is a dead end; the single-cart side is correct.",
    "Kill Piety and loot the Tower Key.",
    "Return to town and talk to Grigor to receive the Book of Skill. Speak with Maramoa to receive the gem reward.",
    "Take the Waypoint to the Ebony Barracks.",
    "Head right of the Waypoint until you find the entrance to the Imperial Gardens.",
    "Follow the tiled path until you find the Waypoint in the Imperial Gardens.",
    "Optional: If you need specific gems from the Library quest, take the upper left path at the three-way fork, up the stairs.",
    "Enter the Library and grab the Waypoint halfway through the area.",
    "Continue until you find the Loose Candle, click it, and enter The Archives.",
    "Collect the Four Golden Pages before returning to town via portal or logout.",
    "Take the Waypoint back to the Library and speak to Siosa for your reward.",
    "Take the Waypoint back to the Imperial Gardens.",
    "Complete the final Labyrinth Trial for the Normal Labyrinth.",
    "From the three-way fork just above the Waypoint, head upwards and snake your way to the left. The Labyrinth Trial is almost always in the uppermost left corner of the area.",
    "From the three-way fork above the Waypoint, head to the lower right and up the stairs.",
    "Start heading to the upper right, following the tiled path until you find the entrance to the Sceptre of God.",
    "Enter the Sceptre of God and ascend the levels until you find the Upper Sceptre of God.",
    "Enter the Upper Sceptre of God and ascend the levels.",
    "Kill Dominus.",
    "Enter the Aqueduct and make your way through the area.",
    "Enter Highgate."
  ],
    "Act 4": [
    "Enter The Dried Lake.",
    "Locate Voll, defeat him, and take Deshret’s Banner. Logout or Portal to Town.",
    "Open the mines using Deshret’s Banner and enter The Mines (Level One).",
    "Proceed through the area and enter The Mines (Level Two).",
    "Locate Deshret’s Spirit and release it.",
    "Enter the Crystal Veins.",
    "Locate the Waypoint at the end of the area, and return to Highgate.",
    "Speak to Tasuni to receive the Book of Skill reward. Speak to Oyun to receive the gem reward.",
    "Complete your first Labyrinth and ascend (recommended here).",
    "Return to the Crystal Veins via the Waypoint.",
    "Enter Kaom’s Dream and proceed through the area until you reach Kaom’s Stronghold.",
    "Acquire the Waypoint and continue onwards until you reach the Caldera of the King.",
    "Defeat Kaom and pick up the Eye of Fury.",
    "Return to town via logout or Portal, then take the Waypoint to the Crystal Veins.",
    "Enter Daresso’s Dream and proceed until you encounter Barkhul.",
    "Defeat Barkhul and his bodyguards, then enter The Grand Arena and acquire the Waypoint.",
    "Proceed through the arenas until you encounter The Trio, a group of three unique enemies.",
    "Defeat The Trio and enter The Ring of Blades.",
    "Defeat Daresso and take the Eye of Desire.",
    "Logout or Portal to Town, then take the Waypoint to the Crystal Veins.",
    "Talk to Dialla.",
    "Enter the Belly of the Beast (Level One) and proceed through the area.",
    "Enter the Belly of the Beast (Level Two) and proceed through the area.",
    "Enter the Bowels of the Beast.",
    "Defeat Piety.",
    "Enter The Harvest and acquire the Waypoint.",
    "Slay Malachai’s 3 guardians: Doedre, Maligaro, and Shavronne. Loot the organs they drop.",
    "Use the 3 organs to enter The Black Core, found next to the Waypoint.",
    "Kill Malachai.",
    "Logout or portal back to town.",
    "Speak to Dialla at the uppermost part of the city to receive the gem reward.",
    "Exit into The Ascent, found in the upper right part of Highgate.",
    "Locate and interact with the resonator, and take the Oriath Portal."
  ],
    "Act 5": [
    "Grab the Waypoint and make your way through the Slave Pens.",
    "Kill Overseer Crow, and ascend the ladder that drops down to enter the Overseer’s Tower.",
    "Talk to Lani to receive the ring reward.",
    "Enter the Control Blocks.",
    "Find the Miasmeter, typically about halfway through the zone on the left-most part of the area.",
    "Kill Justicar Casticus at the end of the area and pick up the Eyes of Zeal.",
    "Enter Oriath Square and grab the Waypoint.",
    "Find and enter the Templar Courts.",
    "Make your way through the zone and enter The Chamber of Innocence, grabbing the immediate Waypoint.",
    "Find The Sanctum of Innocence and kill High Templar Avarius and Innocence.",
    "Enter The Chamber of Innocence through the newly opened exit.",
    "Enter the Torched Courts and make your way through the area.",
    "Enter the Ruined Square.",
    "Enter the Ossuary.",
    "Find the Sign of Purity and return to the Ruined Square via the exit.",
    "Locate The Reliquary.",
    "Find each of Kitava’s Torments and logout or portal to town.",
    "Speak to NPCs for quest rewards.",
    "Prepare for the Kitava fight: ensure elemental resistances are overcapped by roughly 30% due to -30% resistance penalty.",
    "Return to the Ruined Square via Waypoint.",
    "Enter the Cathedral Rooftop and make your way through the area.",
    "Enter the Cathedral Apex and defeat Kitava.",
    "Speak with Lily Roth and sail to Wraeclast."
  ],
    "Act 6": [
    "Exit to The Twilight Strand. Clear the area of all monsters and log out or portal to town, then speak with Lilly Roth.",
    "Enter The Coast and proceed through the zone. Grab the Waypoint at the end.",
    "Enter the Mud Flats. Find and kill The Dishonored Queen and take the Eye of Conquest.",
    "Find the exit to the Karui Fortress, generally in the upper middle part of the area.",
    "Enter Tukohama’s Keep.",
    "Defeat Tukohama. Talk to Sin and select Soul of Tukohama as your Pantheon Minor God.",
    "Find and enter The Ridge.",
    "Grab the Waypoint and return to Lioneye’s Watch. Talk to Tarkleigh to receive a Skill book Reward.",
    "Return to The Ridge via the Waypoint.",
    "Find and enter the Lower Prison and grab the Waypoint just inside the entrance.",
    "Find the Labyrinth trial and complete it.",
    "Find and enter Shavronne’s Tower.",
    "Ascend the tower until you reach the Prison Rooftop.",
    "Kill Brutus and Shavronne.",
    "Go through the Warden’s Chambers and enter the Prisoner’s Gate. Grab the Waypoint.",
    "Find the Valley of the Fire Drinker and defeat Abberath. Logout or Portal to Town and talk to Bestel for the Skill book reward.",
    "Take the Waypoint back to the Prisoner’s Gate. Head in the opposite direction of where you found the Valley of the Fire Drinker.",
    "Enter the Western Forest. Follow the main road to find the Waypoint.",
    "Find and enter The Riverways. Follow the main road to find the Waypoint.",
    "Find and enter The Wetlands, usually in the upper part of the area. Find the Spawning Ground and kill the Puppet Mistress.",
    "Logout or portal to town and speak to Tarkleigh for the Skill book reward.",
    "Return to The Riverways via Waypoint.",
    "Find and enter the Southern Forest, usually located in the middle/lower right of the area.",
    "Grab the Waypoint before exiting into the Cavern of Anger.",
    "Open the Flag Chest and take the Black Flag.",
    "Enter the passage and make your way through the cavern until you reach The Beacon. Enter and immediately acquire the Waypoint.",
    "Locate the pyramid-esque structure and ascend it.",
    "Escort the two pillars to their berths by standing within the glowing circle.",
    "Click on the Ignition Switch and then again on the Beacon.",
    "Talk to Weylam Roth and sail to the Brine King’s Reef. Grab the Waypoint.",
    "Locate and enter the Brine King’s Throne, usually easiest by following the left wall.",
    "Kill the Brine King.",
    "Speak to Sin and grab your Brine King major Pantheon.",
    "Talk to Weylam Roth and sail to Act VII."
  ],
    "Act 7": [
    "Enter the Broken Bridge. Travel towards the bottom left part of the area.",
    "Enter The Crossroads. Follow the road and grab the Waypoint in the center of the zone.",
    "Take the bottom fork from the Waypoint and enter the Fellshrine Ruins.",
    "Enter The Crypt and acquire the Waypoint.",
    "Find the Labyrinth trial and complete it.",
    "Find the Sarcophagus and descend to The Crypt (Level Two).",
    "Locate the Container of Sins and take Maligaro’s Map.",
    "Return to the Bridge Encampment via Portal or logout.",
    "Return to The Crossroads via Waypoint.",
    "Take the upper path from the Waypoint and enter the Chamber of Sins (Level 1).",
    "Grab the Waypoint at the central cross and insert Maligaro’s Map into the Map Device.",
    "Enter Maligaro’s Sanctum and proceed until you find Maligaro’s Workshop.",
    "Kill Maligaro and take the Black Venom. Leave the map via Portal Scroll.",
    "Speak with Silk and take the Obsidian Key.",
    "Find and enter the Chamber of Sins (Level Two).",
    "Find the Labyrinth trial and complete it.",
    "Enter The Den.",
    "Proceed and exit into the Ashen Fields.",
    "Enter the Fortress Encampment.",
    "Slay Greust.",
    "Enter the Northern Forest.",
    "Grab the Waypoint.",
    "Enter the Dread Thicket.",
    "Enter the Den of Despair and kill Gruthkul, then return to the Dread Thicket.",
    "Collect 7 Fireflies from around the Dread Thicket.",
    "Return to the Bridge Encampment and speak with Eramir to receive the two Books of Skill as a reward.",
    "(Optional): Speak with Helena to receive Greust’s Necklace. Place the necklace at the Azmeri Shrine in the Northern Forest if encountered, then speak with Helena in town.",
    "Return to the Northern Forest via the Waypoint.",
    "Find the exit to The Causeway.",
    "Grab the Waypoint when you encounter it.",
    "Acquire Kishara’s Star before leaving the area, usually found next to the exit in Kishara’s Lockbox.",
    "Enter the Vaal City.",
    "Locate Yeena. Note the Vaal City’s complex layout; Yeena and the Waypoint are in the ‘center’ area surrounded by dead ends.",
    "Take the Waypoint back to town and give Kishara’s Star to Weylam for a Skill book reward, then return to Vaal City.",
    "Speak with Yeena and enter the Temple of Decay (Level One).",
    "Enter the Temple of Decay (Level Two).",
    "Enter Arakaali’s Web.",
    "Kill Arakaali.",
    "Enter the Sarn Ramparts.",
    "Enter the Sarn Encampment.",
    "Recommended: Complete the Second Labyrinth here."
  ],
    "Act 8": [
    "Enter the Toxic Conduits.",
    "Locate and enter Doedre’s Cesspool.",
    "Open the grate and enter The Cauldron.",
    "Kill Doedre the Vile.",
    "Exit into the Sewer Outlet and grab the Waypoint.",
    "Take the right path and enter The Quay.",
    "Open the Sealed Casket and take the Ankh of Eternity. The Ankh is typically found near the entrance of the zone; look for a long bridge.",
    "Locate and enter the Resurrection Site and kill Tolman.",
    "Talk to Clarissa.",
    "Return to The Quay.",
    "Enter the Grain Gate and grab the Waypoint. Head upwards through the zone, roughly following the right-upper wall.",
    "Kill the Gemling Legionnaires.",
    "Enter the Imperial Fields and follow the main road to find the Waypoint.",
    "Return to the Sarn Encampment. Speak to Clarissa and Maramoa for the Book of Skill rewards. Speak to Hargan for the ring reward.",
    "Return to the Imperial Fields.",
    "Enter the Solaris Temple (Level One). Acquire the Waypoint if you come across it.",
    "Enter the Solaris Temple (Level Two).",
    "Kill Dawn and take the Sun Orb. Logout or portal to town.",
    "Return to the Solaris Temple (Level One) via Waypoint.",
    "Find and enter the Solaris Concourse.",
    "Acquire the Waypoint and enter the Harbour Bridge.",
    "Run through and enter the Lunaris Concourse.",
    "Acquire the Waypoint and enter the Bath House.",
    "Find the Labyrinth trial and complete it.",
    "Enter the High Gardens and proceed until you encounter the Pools of Terror. Enter and slay Yugul. Logout or portal to town.",
    "Speak to Hargan for the Skill book reward. Return to the Lunaris Concourse via Waypoint.",
    "Enter the Lunaris Temple (Level 1). The path to the Lunaris Temple is the same as in Act III, always heading upwards until you encounter it.",
    "Acquire the Waypoint, then enter the Lunaris Temple (Level 2).",
    "Kill Dusk and take the Moon Orb, then logout or portal to town.",
    "Return to the Lunaris Concourse via Waypoint.",
    "Enter the Harbour Bridge.",
    "Enter the Sky Shrine.",
    "Kill Solaris and Lunaris.",
    "Enter the Blood Aqueducts.",
    "Enter Highgate."
  ],
    "Act 9": [
    "Enter The Descent and head to the right.",
    "Descend via the Supply Hoists until you locate the exit to the Vastiri Desert.",
    "Locate and acquire the Waypoint.",
    "Locate the Storm Weathered Chest. Defeat the waves of mummies that ambush you, then take the Storm Blade.",
    "Return to town via Portal Scroll and speak with Petarus and Vanja.",
    "Talk to Sin, then speak again with Petarus and Vanja to take the Bottled Storm.",
    "Use your portal to return to the Vastiri Desert.",
    "Find the entrance to The Oasis, which will now be accessible using the Bottled Storm.",
    "Traverse the area and enter the Sand Pit. Kill Shakari and logout or portal to town.",
    "Speak to Irasha for the Skill book reward. Return to the Vastiri Desert via Waypoint.",
    "Enter The Foothills.",
    "Find the Waypoint, usually located in the upper right part of the area.",
    "Enter the Boiling Lake.",
    "Kill the Basilisk and take the Basilisk Acid. You know you are in the area where the Basilisk is located once you begin to see groups of petrified enemies.",
    "Logout or portal to town and take the Waypoint back to The Foothills.",
    "Enter The Tunnel, usually found in the upper or upper left part of the area.",
    "Acquire the Waypoint.",
    "Find the Labyrinth trial and complete it.",
    "Enter The Quarry. Run straight to the middle of the zone and acquire the Waypoint.",
    "These steps can be completed in either order based on what you encounter first.",
    "Enter The Refinery.",
    "Optional: If you need the Trigger a Socketed Spell when you Use a Skill craft look for this grate, it will take you underground to the area with the craft.",
    "Explore the area until you find General Adus, then kill him. He is found in his own little arena, generally in the upper or upper left part of the area. Usually, he is found faster if you take the left path from the start of the area.",
    "Interact with the Theurgic Precipitate Machine and take the Trarthan Powder.",
    "Portal or logout, then return to The Quarry via Waypoint.",
    "Enter the Shrine of the Winds and slay Garukhan.",
    "Return to town via Portal or logout, then speak with Irasha to receive the Skill book reward.",
    "Return to The Quarry via Waypoint.",
    "Talk to Sin and enter the Belly of the Beast.",
    "Enter the Rotting Core and make your way through the area.",
    "Enter the Black Core and talk to Sin.",
    "Enter each of the portals in your order of choosing and defeat Malachai’s guardians (Shavronne, Maligaro, and Doedre).",
    "Enter the Black Heart and kill the Depraved Trinity.",
    "Talk to Lilly Roth and sail to Oriath."
  ],
    "Act 10": [
    "Enter the Cathedral Rooftop.",
    "Enter the Cathedral Apex, on the immediate left of entering the rooftop area.",
    "Kill the Cultists and Gargoyles to free Bannon.",
    "Return to the Cathedral Rooftop and make your way to the right.",
    "Enter the Ravaged Square.",
    "Head downwards and right until you find the Control Blocks entrance and enter it.",
    "Pick up the Waypoint, then find Vilenta, located roughly where the Miasmeter was in Act V. Kill Vilenta logout or portal to town.",
    "Talk to Lani to receive the Book of Skill reward and take the Waypoint to Control Blocks and exit to Ravaged Square.",
    "Head upwards until you encounter the Waypoint, acquire it, and enter Ossuary.",
    "Find the Labyrinth trial and complete it; it is close to the Waypoint. Then logout or portal to town.",
    "Optional: the Elixir of Allure (rewards Respec points) is also near the Waypoint.",
    "Take the Waypoint to Ravaged Square, find and enter the Torched Courts and proceed through the area.",
    "Enter the Desecrated Chambers, which has a similar layout to the Chambers of Innocence from Act V. Grab the immediate Waypoint.",
    "Find and kill Avarius, Reassembled.",
    "Return to the Oriath Docks using the Waypoint.",
    "Talk to Bannon, then talk to Lani to receive the Flask and Armor rewards.",
    "This is where we recommend you do the third labyrinth, so that it is done before being afflicted with Kitava’s Affliction again.",
    "Ensure you are 30% over your caps for elemental resistance to avoid issues following Kitava’s imminent death.",
    "Talk to Innocence.",
    "Return to the Ravaged Square and head upwards until you find Innocence. Speak with him.",
    "Enter the Canals and proceed through the area.",
    "Enter The Feeding Trough and proceed through the area.",
    "Speak with Sin and enter the Altar of Hunger.",
    "Kill Kitava.",
    "Speak with Lani in Oriath to receive the Skill book reward."
  ]
}